lhzloveyyj/FOC_V24/AT32F403ACGT7_WorkBench/project - 副本/src/main.c
/* add user code begin Header */
/**
  **************************************************************************
  * @file     main.c
  * @brief    main program
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */
/* add user code end Header */

/* Includes ------------------------------------------------------------------*/
#include "at32f403a_407_wk_config.h"
#include "wk_adc.h"
#include "wk_debug.h"
#include "wk_spi.h"
#include "wk_tmr.h"
#include "wk_usart.h"
#include "wk_dma.h"
#include "wk_gpio.h"
#include "wk_system.h"

/* private includes ----------------------------------------------------------*/
/* add user code begin private includes */
#include "mt6701.h"
#include "delay.h"
#include "log.h"
#include "foc.h"
/* add user code end private includes */

/* private typedef -----------------------------------------------------------*/
/* add user code begin private typedef */

/* add user code end private typedef */

/* private define ------------------------------------------------------------*/
/* add user code begin private define */

/* add user code end private define */

/* private macro -------------------------------------------------------------*/
/* add user code begin private macro */

/* add user code end private macro */

/* private variables ---------------------------------------------------------*/
/* add user code begin private variables */

/* add user code end private variables */

/* private function prototypes --------------------------------------------*/
/* add user code begin function prototypes */

/* add user code end function prototypes */

/* private user code ---------------------------------------------------------*/
/* add user code begin 0 */

/* add user code end 0 */

/**
  * @brief main function.
  * @param  none
  * @retval none
  */
int main(void)
{
  /* add user code begin 1 */

  /* add user code end 1 */

  /* system clock config. */
  wk_system_clock_config();

  /* config periph clock. */
  wk_periph_clock_config();

  /* init debug function. */
  wk_debug_config();

  /* nvic config. */
  wk_nvic_config();

  /* timebase config. */
  wk_timebase_init();

  /* init gpio function. */
  wk_gpio_config();

  /* init adc1 function. */
  wk_adc1_init();

  /* init dma1 channel1 */
  wk_dma1_channel1_init();
  /* config dma channel transfer parameter */
  /* user need to modify define values DMAx_CHANNELy_XXX_BASE_ADDR and DMAx_CHANNELy_BUFFER_SIZE in at32xxx_wk_config.h */
  wk_dma_channel_config(DMA1_CHANNEL1, 
                        (uint32_t)&USART1->dt, 
                        DMA1_CHANNEL1_MEMORY_BASE_ADDR, 
                        DMA1_CHANNEL1_BUFFER_SIZE);
  dma_channel_enable(DMA1_CHANNEL1, TRUE);

  /* init dma1 channel2 */
  wk_dma1_channel2_init();
  /* config dma channel transfer parameter */
  /* user need to modify define values DMAx_CHANNELy_XXX_BASE_ADDR and DMAx_CHANNELy_BUFFER_SIZE in at32xxx_wk_config.h */
  wk_dma_channel_config(DMA1_CHANNEL2, 
                        (uint32_t)&USART1->dt, 
                        DMA1_CHANNEL2_MEMORY_BASE_ADDR, 
                        DMA1_CHANNEL2_BUFFER_SIZE);
  dma_channel_enable(DMA1_CHANNEL2, TRUE);

  /* init dma1 channel3 */
  wk_dma1_channel3_init();
  /* config dma channel transfer parameter */
  /* user need to modify define values DMAx_CHANNELy_XXX_BASE_ADDR and DMAx_CHANNELy_BUFFER_SIZE in at32xxx_wk_config.h */
  wk_dma_channel_config(DMA1_CHANNEL3, 
                        (uint32_t)&ADC1->odt, 
                        DMA1_CHANNEL3_MEMORY_BASE_ADDR, 
                        DMA1_CHANNEL3_BUFFER_SIZE);
  dma_channel_enable(DMA1_CHANNEL3, TRUE);

  /* init usart1 function. */
  wk_usart1_init();

  /* init usart3 function. */
  wk_usart3_init();

  /* init spi1 function. */
  wk_spi1_init();

  /* init tmr1 function. */
  wk_tmr1_init();

  /* init tmr2 function. */
  wk_tmr2_init();

  /* add user code begin 2 */
  delay_init();
  
  //USART1_TX_DMA
  dma_interrupt_enable(DMA1_CHANNEL2, DMA_FDT_INT, TRUE);
  //USART_1_RX
  usart_interrupt_enable(USART1, USART_IDLE_INT, TRUE);
  
  delay_ms(1000);
 
  AngleInitZeroOffset();
  
  tmr_interrupt_enable(TMR2,TMR_OVF_INT,TRUE);
  
  dma_interrupt_enable(DMA1_CHANNEL3, DMA_FDT_INT, TRUE);
		
  /* add user code end 2 */

  while(1)
  {
    /* add user code begin 3 */
//	  printf("mechanicalAngle is %lf\r\n",g_pMotor->mechanicalAngle);
	  //float Uabc[3] = {g_pMotor->ua, g_pMotor->ub, g_pMotor->uc};
	  //float Uqd[2] = {g_pMotor->uq, g_pMotor->ud};
	  //float Ualpha_Ubeta[2] = {g_pMotor->uAlpha, g_pMotor->uBeta};
	  //float Tabc[3] = {PSVpwm->Ta,PSVpwm->Tb,PSVpwm->Tc};
	  //float sector[1] = {PSVpwm->sector};
	  
	  //USART1_SendFloatArray(Tabc, 3);
//	  tmr_channel_value_set(TMR1, TMR_SELECT_CHANNEL_1, 0.5 * 5000);
//	  tmr_channel_value_set(TMR1, TMR_SELECT_CHANNEL_2, 0.9 * 5000);
//      tmr_channel_value_set(TMR1, TMR_SELECT_CHANNEL_3, 0.1 * 5000);
//	  tmr_channel_value_set(TMR1, TMR_SELECT_CHANNEL_4,  100);
	  printf("%d,%d,%d\r\n",g_motorAdValues[0], g_motorAdValues[1], g_motorAdValues[2]);
	  //printf("%d\r\n",cnt);
	  //delay_ms(500);
    /* add user code end 3 */
  }
}

  /* add user code begin 4 */

  /* add user code end 4 */
